var saidan = prompt("შეიყვანეთ ენა საიდანაც გინდათ რომ ითარგმნოს სიტყვა. (ქართული, ინგლისური ან ფრანგული)")
var sad = prompt("შეიყვანეთ ენა რომელზეც გინდათ რომ ითარგმნოს სიტყვა (ქართული, ინგლისური ან ფრანგული)")
var romeli = prompt("შეიყვანეთ სიტყვა (ერთი, ორი ან სამი)(one, two or three)(un, deux ou trois)")

var qaring = [["ერთი", "one"],["ორი", "two"],["სამი", "three"]] 
var qarfra = [["ერთი", "un"],["ორი", "deux"],["სამი", "trois"]]
var ingfra = [["one", "un"],["two", "deux"],["three", "trois"]]


for(var i of qaring){
    if(saidan == "ქართული" && sad == "ინგლისური" && romeli == i[0])         {console.log(i[0])}
    else if(saidan == "ინგლისური" && sad == "ქართული" && romeli == i[1])    {console.log(i.reverse()[1])}
    else{console.log("სამწუხაროდ ან თვქენს მიერ შეყვანილი სიტყვა არ არის სწორად შეყვანილი ან ლექსიკონში არ გვაქვს და სიტყვების დამატების ფუნქცია არ გვაქვს ჯერ")}
}
for(var i of qarfra){
    if(saidan == "ქართული" && sad == "ფრანგული" && romeli == i[0])          {console.log(i[0])}
    else if(saidan == "ფრანგული" && sad == "ქართული" && romeli == i[1])     {console.log(i.reverse()[1])}
    else{console.log("სამწუხაროდ ან თვქენს მიერ შეყვანილი სიტყვა არ არის სწორად შეყვანილი ან ლექსიკონში არ გვაქვს და სიტყვების დამატების ფუნქცია არ გვაქვს ჯერ")}
}
for(var i of ingfra){
    if(saidan == "ინგლისური" && sad == "ფრანგული" && romeli == i[0])        {console.log(i[0])}
    else if(saidan == "ფრანგული" && sad == "ინგლისური" && romeli == i[1])   {console.log(i.reverse()[1])}
    else{console.log("სამწუხაროდ ან თვქენს მიერ შეყვანილი სიტყვა არ არის სწორად შეყვანილი ან ლექსიკონში არ გვაქვს და სიტყვების დამატების ფუნქცია არ გვაქვს ჯერ")}
}






// პროექტის მეოთხე დავალება
// უნდა შევქმნათ თარჯიმანი, სადაც მომხმარებელი ირჩევს რომელი ენიდან რომელზე სურს გადათარგმნა
// ამის შემდეგ მომხმარებელს შეყავს სიტყვა და უნდა გამოჩნდეს მისი თარგმანი
// თუ სიტყვა არ აღმოჩნდა ლექსიკონში მომხმარებელს უნდა შეეძლოს სიტყვის შეყვანა თავის განმარტებიანად.




  // else{
    // // var axali = prompt("თუ ენები სწორად გქონდათ შერჩეული და სიტყვაც შესაბამის (პირველ) ენაზე შეიყვანეთ და სიტყვა არ მოიძებნა შესაბამისად ეს სიტყვა არ არის ჩვენს ლექსიკონში და შეგიძლიათ თქვენ დაამატოთ. გთხოვთ შეიყვანოთ სიტყვა ორივე ენაზე.")
    // // console.log(axali)
    // // zeaxali = axali.split(" ");
    // // console.log(zeaxali)
    // // qaring.push(zeaxali)
    // // for(var i of qaring){console.log(qaring[i])}
    // }